{*------------------------------------------------------------------------------
  Интерфейс сервиса для работы с пользовательским вводом данных   
  Распознавание символов 
  Курсовая работа по дисциплине "Технология программирования"
  @Author    Студент гр. ВС1-06 Горчакова М. М.
  @Version   2010.03.23   Горчакова М. М.	Initial revision                                       
-------------------------------------------------------------------------------}

unit userInputService;

interface

type
    IUserInputService = interface
        ['{CEA6DF84-397F-4005-A5F6-A79A264C90C4}']
        function inputNumber() : string;
    end;

implementation

end.

